Suspicious PowerShell Execution
--> kql
DeviceProcessEvents
| where FileName in~ ("powershell.exe", "pwsh.exe")
| where ProcessCommandLine contains "IEX" or ProcessCommandLine contains "Invoke-WebRequest"
| project Timestamp, DeviceName, InitiatingProcessAccountName, ProcessCommandLine
